tap "devenjarvis/tap"
tap "nikitabobko/tap"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Terminal user interface client for Discord
brew "concord"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Simple and efficient way to access statistics in git
brew "git-quick-stats"
# Render markdown on the CLI
brew "glow"
# Better kubectl explain with the fuzzy finder
brew "kubectl-explore"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Manage multiple Node.js versions
brew "nvm"
# Password manager
brew "pass"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# General purpose fuzzy finder TUI
brew "television"
# AeroSpace is an i3-like tiling window manager for macOS
cask "nikitabobko/tap/aerospace", trusted: true
cask "font-caskaydia-cove-nerd-font"
cask "font-fantasque-sans-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-mononoki-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "font-victor-mono-nerd-font"
# Generate, store, serve, verify, and extend hands-on technical tutorials
cask "devenjarvis/tap/lathe", trusted: true
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# System monitor for the menu bar
cask "stats"
# Multiplayer code editor
cask "zed"
npm "@openai/codex"
npm "corepack"
